# ThermalMaterialParamSpecificHeatOfVaporization Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ThermalMaterialParamSpecificHeatOfVaporization Property
ParameterTypeId Class See Also
---
"Specific Heat of Vaporization"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ThermalMaterialParamSpecificHeatOfVaporization { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ThermalMaterialParamSpecificHeatOfVaporization As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ThermalMaterialParamSpecificHeatOfVaporization {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace